In [16]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series([1, 2, 3, 4, 5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
pd.date_range(start='1/1/2018', end='1/3/2018')

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03'], dtype='datetime64[ns]', freq='D')

In [18]:
fechas = pd.date_range(start="2023-01-01", periods=3, freq="D")
fechas

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03'], dtype='datetime64[ns]', freq='D')

In [19]:
data = np.random.randint(1, 100, size=(3, 3))

In [20]:

df = pd.DataFrame(data, index=fechas, columns=["A", "B", "C"])
df

             A   B   C
2023-01-01  81  23  84
2023-01-02  82  94  43
2023-01-03  61  22  58

In [24]:
df[0:2]

             A   B   C
2023-01-01  81  23  84
2023-01-02  82  94  43

In [29]:
idx = df['A'] > 62
res = df[idx]
res

             A   B   C
2023-01-01  81  23  84
2023-01-02  82  94  43

In [33]:
df

             A   B   C   D
2023-01-01  81  23  84 NaN
2023-01-02  82  94  43 NaN
2023-01-03  61  22  58 NaN

In [35]:
df['D'] = df.apply(lambda x: np.mean(x), axis=1)
df

             A   B   C          D
2023-01-01  81  23  84  62.666667
2023-01-02  82  94  43  73.000000
2023-01-03  61  22  58  47.000000

In [36]:
df['E'] = ['one', 'two', 'three']

In [41]:
df['E'].isin(['two', 'three'])

2023-01-01    False
2023-01-02     True
2023-01-03     True
Freq: D, Name: E, dtype: bool

In [ ]:
pd.melt(df)